testAme/labs/lab7/reactingFlowIf/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
	chemistrySolver		EulerImplicit;
	chemistryThermo		psi;
}

chemistry       		off;

initialChemicalTimeStep 	1e-08;

EulerImplicitCoeffs
{
	cTauChem		1;
	equilibriumRateLimiter	on;
}

#include "$FOAM_CASE/constant/reactions"

// ************************************************************************* //
