testAme/labs/lab7/reactingFlowIf/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel infinitelyFastChemistry;

active		yes;

semiImplicit 	no;

infinitelyFastChemistryCoeffs
{
	C		1.0;
       semiImplicit	yes;	
}

reaction
{
	type 		irreversibleArrheniusReaction;
	reaction	"CH4 + 2O2 = CO2 + 2H2O";
	A		5.2e16;
	beta		0;
	Ta		14906;
}

// ************************************************************************* //
