testAme/labs/lab7/reactingFlowIf/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
15677
(
(-0.618582 6.04653 0)
(0.665456 9.25131 0)
(-0.0684472 3.18005 0)
(0.189376 9.89771 0)
(0.191274 7.25252 0)
(0.00257378 2.67472 0)
(0.289523 10.043 0)
(0.134144 9.22557 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 10 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    splitter
    {
        type            noSlip;
    }
    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0 15 0);
    }
    back
    {
        type            noSlip;
    }
    sides
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
