testAme/labs/lab7/reactingFlowIf/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    splitter
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
12.0362
13.6281
14.4425
14.4425
13.6281
12.0362
11.5154
11.5339
...
)
;
    }
    fuel_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            calculated;
        value           nonuniform List<scalar> 
31
(
7.88779
7.88779
7.88779
7.88779
7.88779
7.88779
7.88779
7.88779
...
)
;
    }
    sides
    {
        type            calculated;
        value           nonuniform List<scalar> 
260
(
11.2268
11.2268
11.2268
11.2268
11.2268
11.2268
11.2268
11.2268
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
